// /* eslint-disable no-sparse-arrays */
import { combineReducers } from 'redux';
/* eslint-disable no-lonely-if */
import { createSlice } from '@reduxjs/toolkit';
import lodash from 'lodash';
import undoable from 'redux-undo';

const V_TABLE = {
  id: 'R1.B.2',
  type: 'vTable',
  name: 'таблица 1',
  size: {
    minimalHeight: 10,
    autofitWidth: false,
    autofitHeight: false
  },
  position: {
    xType: 'Absolute',
    yType: 'Absolute',
    x: 20,
    y: 40
  },
  content: {
    layout: {
      headerZone: {
        id: 'R1.B.2.H',
        shown: true,
        cells: [
          {
            id: 'R1.B.2.H.1',
            row: 1,
            col: 1,
            size: { minimalHeight: 12, minimalWidth: 100 },
            style: { font: { size: 12 } },
            expression: {
              type: 'Const',
              dataType: 'String',
              formula: 'Тип учредителя'
            }
          },
          {
            id: 'R1.B.2.H.2',
            row: 1,
            col: 2,
            size: { minimalWidth: 200 },
            style: { font: { size: 12 } },
            expression: {
              type: 'Const',
              dataType: 'String',
              formula: 'Наименование учредителя'
            }
          },
          {
            id: 'R1.B.2.H.3',
            row: 1,
            col: 3,
            size: { minimalWidth: 90 },
            style: { font: { size: 12 } },
            expression: {
              type: 'Const',
              dataType: 'String',
              formula: 'Доля(руб)'
            }
          }
        ]
      },
      bodyZone: {
        id: 'R1.B.2.B',
        shown: true,
        cells: [
          {
            id: 'R1.B.2.B.1',
            row: 1,
            col: 1,
            size: { minimalHeight: 11 },
            style: { font: { size: 10 } },
            expression: {
              type: 'Dimension',
              dataType: 'String',
              variable_id: 'DP0.V2',
              formula: '=[Тип учредителя]',
              parsedFormula: '=[DP0.D2]'
            }
          },
          {
            id: 'R1.B.2.B.2',
            row: 1,
            col: 2,
            style: { font: { size: 8 } },
            expression: {
              type: 'Dimension',
              dataType: 'String',
              variable_id: 'DP0.V3',
              formula: '=[Наименование учредителя]',
              parsedFormula: '=[DP0.D3]'
            }
          },
          {
            id: 'R1.B.2.B.3',
            row: 1,
            col: 3,
            size: { minimalWidth: 90 },
            style: { font: { size: 12 } },
            expression: {
              type: 'Measure',
              dataType: 'Number',
              variable_id: 'DP0.V4',
              formula: '=[Доля(руб)]',
              parsedFormula: '=[DP0.M4]'
            }
          }
        ]
      },
      footerZone: {
        id: 'R1.B.2.F',
        shown: false,
        cells: [
          {
            id: 'R1.B.2.F.1',
            row: 1,
            col: 1,
            size: { minimalHeight: 12 },
            style: { font: { size: 11 } }
          },
          {
            id: 'R1.B.2.F.2',
            row: 1,
            col: 2,
            style: { font: { size: 11 } },
            expression: {
              type: 'Const',
              dataType: 'String',
              formula: 'Сумма:'
            }
          },
          {
            id: 'R1.B.2.F.3',
            row: 1,
            col: 3,
            style: { font: { size: 11 } },
            expression: {
              type: 'Measure',
              dataType: 'Number',
              variable_id: 'DP0.V4',
              formula: '=sum([Доля(руб)])',
              parsedFormula: '=SUM([DP0.M4])'
            }
          }
        ]
      }
    }
  }
};

export const variableObject = {
  varType: 'DP',
  dp_id: 'DP0',
  id: 'DP0.V1',
  name: 'Первая буква города',
  type: 'Dimension',
  dataType: 'String',
  formula: '=substr([Город], 1, 1)',
  parsedFormula: '=f1([DP0.D2], 1, 1)'
};
export const reportObject = {
  header: {
    // report header
    service: '1.1.1.1:22333',
    thread: '<thread_id>',
    id: 100009,
    guid: 'BE287C4B-B9AC-432E-9502-ECDEF82D8DAD',
    parent_id: 100007,
    name: 'Тестовый СС 1',
    description: '',
    owner_id: 10002,
    createUser_id: 10002,
    create_ts: '2022-05-02 20:18:00.0',
    updateUser_id: 10002,
    update_ts: '2022-05-02 20:18:00.0',
    version: '0.0.1',
    releaseNumber: 1
  },
  data: {
    properties: {
      refreshOnOpen: false,
      purgeBeforeSave: false
    },
    dps: [
      {
        // поставщик данных из ручного SQL
        dpType: 'directSql',
        dpName: 'SQL Запрос 1',
        dp_id: 'DP0',
        // Параметры соединения PostgreSQL:
        //  ConnectionString="SERVER=192.168.4.148;PORT=5432;DATABASE=TA;UID=test_usr;PWD=1;"
        dpConnect_id: 100089,
        dpProperties: {}, // ограничения по кол-ву строк, по времени, признак уникальности..
        dpSql:
          "select id, egr_id, founder_type, trim(replace(src_key, '#', ' ')) as name, share_value_rub, share_percent, from_date\n  from \"TERN_ANALYTICS_EGR\".egrul_founder f\n  where share_value_rub is not null\n limit 50000",
        dpData: [
          [
            4,
            14064252,
            'ФЛ',
            'НИКОЛАЙ КУЗИН АЛЕКСАНДРОВИЧ',
            10000,
            0,
            '2015-08-28'
          ],
          [
            5,
            14064267,
            'ФЛ',
            'АЗАТ ЮСУПОВ ШАРИФЗЯНОВИЧ 027201641264',
            17796,
            0,
            '2015-08-28'
          ],
          [
            6,
            14064290,
            'ФЛ',
            'ТАТЬЯНА ТИТОРЕНКО ВЛАДИМИРОВНА 233404682670',
            400000,
            39.6,
            '2015-08-28'
          ],
          [
            7,
            14064290,
            'ФЛ',
            'ФЕДОР ЛОБОДА АЛЕКСАНДРОВИЧ 230308238674',
            610000,
            60.4,
            '2015-08-28'
          ],
          [
            8,
            14064291,
            'ФЛ',
            'НИКОЛАЙ МАРКОВ БОРИСОВИЧ 781100691240',
            10000,
            100,
            '2015-08-28'
          ],
          [
            9,
            14064295,
            'ФЛ',
            'НИКОЛАЙ ТИМОФЕЕВ ИГОРЕВИЧ 782507565900',
            10000,
            100,
            '2015-08-28'
          ],
          [
            10,
            14064319,
            'ФЛ',
            'ЮРИЙ РЫЖИКОВ НИКОЛАЕВИЧ 781143183185',
            10000,
            100,
            '2015-08-28'
          ],
          [
            11,
            14064337,
            'ФЛ',
            'АЛЕКСЕЙ ПУПКОВ ВАЛЕРЬЕВИЧ 580507147767',
            10000,
            100,
            '2015-08-28'
          ],
          [
            14,
            14064345,
            'ФЛ',
            'АРТЁМ АКИЛОВ ВЯЧЕСЛАВОВИЧ 743015068361',
            2000,
            11.8,
            '2015-08-28'
          ],
          [
            15,
            14064348,
            'ФЛ',
            'ЛИДИЯ ВАСИЛЕНКО ФЕДОРОВНА 781010613375',
            7000,
            70,
            '2015-08-28'
          ],
          [
            16,
            14064348,
            'ФЛ',
            'ЮЛИЯ БОРИСЕНКО ВАЛЕРЬЕВНА',
            3000,
            30,
            '2015-08-28'
          ],
          [
            17,
            14064352,
            'ФЛ',
            'ЭЛИНА СУФИЯНОВА ФЕРДАВУСОВНА 021703335615',
            10000,
            100,
            '2015-08-28'
          ],
          [
            18,
            14064368,
            'ФЛ',
            'ВЛАДИМИР КОБЫЛИНСКИЙ СЕРГЕЕВИЧ 711305850680',
            45000,
            100,
            '2015-08-28'
          ],
          [
            19,
            14064374,
            'ЮЛИн',
            '690   КРЕЙСЭЙР ПАРТНЕРС ИНК.',
            10000,
            100,
            '2015-08-28'
          ],
          [
            20,
            14064406,
            'ФЛ',
            'ЭДУАРД ЛЯГУШЕВ ЛЕОНИДОВИЧ 246000052970',
            20000,
            100,
            '2015-08-28'
          ],
          [
            21,
            14064412,
            'ФЛ',
            'ЕЛЕНА ЛАЗАРЕВА АНАТОЛЬЕВНА',
            5000,
            0,
            '2015-08-28'
          ],
          [
            22,
            14064412,
            'ФЛ',
            'ДМИТРИЙ ЛАЗАРЕВ ВАСИЛЬЕВИЧ',
            5000,
            0,
            '2015-08-28'
          ],
          [
            23,
            14064431,
            'ФЛ',
            'ИРИНА ОГОЛЬЦОВА АНАТОЛЬЕВНА',
            10000,
            0,
            '2015-08-28'
          ],
          [
            24,
            14064453,
            'ФЛ',
            'НИНА ОРФАНИДИС ВИКТОРОВНА 581300251080',
            10000,
            100,
            '2015-08-28'
          ],
          [
            27,
            14064492,
            'ФЛ',
            'МАКСИМ МОРЯКОВ СЕРГЕЕВИЧ 027811759500',
            11000,
            100,
            '2015-08-28'
          ],
          [
            28,
            14064493,
            'ФЛ',
            'МИХАИЛ АРТЕМЬЕВ ЮРЬЕВИЧ 781021219596',
            10000,
            100,
            '2015-08-28'
          ],
          [
            29,
            14064538,
            'ФЛ',
            'ДЕНИС ОЛОХОВ АНАТОЛЬЕВИЧ 745010904168',
            10000,
            100,
            '2015-08-28'
          ],
          [
            30,
            14064545,
            'ФЛ',
            'ОЛЬГА АЛЕМАСОВА ВЛАДИМИРОВНА',
            10000,
            0,
            '2015-08-28'
          ],
          [
            31,
            14064553,
            'ФЛ',
            'НАДЕЖДА МУЛЛАГАЯНОВА МИХАЙЛОВНА 430702216392',
            1000000,
            100,
            '2015-08-28'
          ],
          [
            32,
            14064621,
            'ФЛ',
            'ДМИТРИЙ РЫБАЛЬЧИК БОРИСОВИЧ 631626100810',
            10000,
            100,
            '2015-08-28'
          ],
          [
            34,
            14064628,
            'ФЛ',
            'АЛЕКСЕЙ МЕХРЯКОВ ФЕДОРОВИЧ 663601074078',
            5000,
            0,
            '2015-08-28'
          ],
          [
            35,
            14064628,
            'ФЛ',
            'АНДРЕЙ СУМИН ВЛАДИМИРОВИЧ 663600807702',
            5000,
            0,
            '2015-08-28'
          ],
          [
            36,
            14064628,
            'ФЛ',
            'ИГОРЬ ЖДАНОВ ВЛАДИМИРОВИЧ 660400256107',
            5000,
            0,
            '2015-08-28'
          ],
          [
            37,
            14064628,
            'ФЛ',
            'ВЛАДИМИР МАКУРИН ВЛАДИМИРОВИЧ 666001035682',
            5000,
            0,
            '2015-08-28'
          ],
          [
            38,
            14064628,
            'ЮЛРос',
            '1096646000428 6646015443  ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "ПОТАШКИНСКОЕ"',
            5000,
            0,
            '2015-08-28'
          ],
          [
            39,
            14064646,
            'ФЛ',
            'ИВАН КОНОШЕНКО ГЕННАДЬЕВИЧ 650903148172',
            10000,
            100,
            '2015-08-28'
          ],
          [
            40,
            14064661,
            'ЮЛРос',
            '1037739039513 7726266959  АКЦИОНЕРНОЕ ОБЩЕСТВО "КОМПАНИЯ "ОВА"',
            10000,
            100,
            '2015-08-28'
          ],
          [
            41,
            14064665,
            'ФЛ',
            'ВАДИМ СТЕПАНОВ ГЕННАДЬЕВИЧ 532203779237',
            10000,
            100,
            '2015-08-28'
          ],
          [
            42,
            14064666,
            'ФЛ',
            'ЮРИЙ КОВРИГИН ЕВГЕНЬЕВИЧ 503409785438',
            32500,
            100,
            '2015-08-28'
          ],
          [
            43,
            14064672,
            'ФЛ',
            'МИХАИЛ ЖУКОВ АНАТОЛЬЕВИЧ 643204939928',
            10000,
            100,
            '2015-08-28'
          ],
          [
            44,
            14064680,
            'ЮЛРос',
            '1077746365113 7736554890  ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ "ПС ЯНДЕКС.ДЕНЬГИ"',
            90000000,
            100,
            '2015-08-28'
          ],
          [
            45,
            14064681,
            'ФЛ',
            'АЛЕКСАНДР ХОХЛОВ НИКОЛАЕВИЧ 784300819704',
            10000,
            100,
            '2015-08-28'
          ],
          [
            46,
            14064762,
            'ФЛ',
            'ИГОРЬ ГАВРИЛИН ГЕРМАНОВИЧ',
            2500,
            0,
            '2015-08-28'
          ],
          [
            47,
            14064762,
            'ФЛ',
            'ИВАН ЛАРИОНОВ ПЕТРОВИЧ 623102865520',
            2500,
            0,
            '2015-08-28'
          ],
          [
            48,
            14064762,
            'ФЛ',
            'ДМИТРИЙ ОСИПОВ ЕВГЕНЬЕВИЧ',
            2500,
            0,
            '2015-08-28'
          ],
          [
            49,
            14064762,
            'ФЛ',
            'ВЛАДИМИР БЕЛОВ ЛЕОНИДОВИЧ 622701106093',
            2500,
            0,
            '2015-08-28'
          ],
          [
            50,
            14064765,
            'ФЛ',
            'ЭЛЬЧИН ИСМАИЛОВ ДАВУД-ОГЛЫ 645503735940',
            10000,
            100,
            '2015-08-28'
          ],
          [
            51,
            14064816,
            'ФЛ',
            'НУРМАГОМЕД ГАДЖИЕВ РАСУЛОВИЧ 772773174393',
            1000000,
            94.6,
            '2015-08-28'
          ],
          [
            106,
            14065265,
            'ФЛ',
            'ОЛЬГА ЧЕСНОКОВА МИХАЙЛОВНА',
            1,
            0,
            '2015-08-28'
          ],
          [
            107,
            14065265,
            'ФЛ',
            'ГРИГОРИЙ ДЖАМГАРОВ АРАМОВИЧ 366503103842',
            5,
            0,
            '2015-08-28'
          ],
          [
            108,
            14065265,
            'ФЛ',
            'ВАЛЕНТИНА ЧУРИЛОВА АЛЕКСЕЕВНА 366503102711',
            1,
            0,
            '2015-08-28'
          ],
          [
            110,
            14065265,
            'ФЛ',
            'АННА ПОЛЯКОВА ВАСИЛЬЕВНА 366200554973',
            1,
            0,
            '2015-08-28'
          ],
          [
            113,
            14065320,
            'ФЛ',
            'АЛЕКСАНДР ДЕВИЦЫН НИКОЛАЕВИЧ 682000613311',
            7500,
            50,
            '2015-08-28'
          ],
          [
            114,
            14065320,
            'ФЛ',
            'НИКОЛАЙ КОБЕЛЕВ ЕВГЕНЬЕВИЧ 682007795639',
            7500,
            50,
            '2015-08-28'
          ],
          [
            115,
            14065338,
            'ФЛ',
            'ДМИТРИЙ СЕРОВ ГРИГОРЬЕВИЧ',
            2500,
            0,
            '2015-08-28'
          ],
          [
            116,
            14065338,
            'ФЛ',
            'АЛЕКСАНДР ЛОСЕВ ВИКТОРОВИЧ',
            2500,
            0,
            '2015-08-28'
          ],
          [
            117,
            14065338,
            'ФЛ',
            'НИКОЛАЙ АНАНЬЕВ ИВАНОВИЧ',
            2500,
            0,
            '2015-08-28'
          ],
          [
            119,
            14065349,
            'ФЛ',
            'ТАТЬЯНА РИКШПУН АЛЕКСАНДРОВНА 772880992851',
            10000,
            100,
            '2015-08-28'
          ],
          [
            120,
            14065354,
            'ЮЛИн',
            '250   АКЦИОНЕРНОЕ ОБЩЕСТВО УПРОЩЕННОЙ СТРУКТУРЫ "РЕНО"',
            1278513332.38,
            0,
            '2015-08-28'
          ],
          [
            121,
            14065354,
            'ЮЛРос',
            '1027700149410 7707058720  ДЕПАРТАМЕНТ ГОСУДАРСТВЕННОГО И МУНИЦИПАЛЬНОГО ИМУЩЕСТВА ГОРОДА МОСКВЫ',
            403741564.82,
            0,
            '2015-08-28'
          ],
          [
            122,
            14065401,
            'ФЛ',
            'ДЕНИС БУГАЕВ ЮРЬЕВИЧ',
            14000,
            100,
            '2015-08-28'
          ],
          [
            123,
            14065425,
            'ФЛ',
            'РАФАЭЛЬ ДАВЛЕТБАЕВ ФАРИТОВИЧ 352800787285',
            10000,
            100,
            '2015-08-28'
          ],
          [
            124,
            14065450,
            'ФЛ',
            'ДМИТРИЙ ВЕРХОТИН АЛЕКСЕЕВИЧ 780247522176',
            10000,
            100,
            '2015-08-28'
          ],
          [
            125,
            14065470,
            'ФЛ',
            'ДМИТРИЙ ВОЛКОВ ЛЬВОВИЧ',
            8000,
            0,
            '2015-08-28'
          ],
          [
            126,
            14065470,
            'ФЛ',
            'ДМИТРИЙ ТРУТОВСКИЙ БОРИСОВИЧ',
            8000,
            0,
            '2015-08-28'
          ],
          [
            127,
            14065473,
            'ФЛ',
            'СВЯТОСЛАВ БОЧАРНИКОВ ИГОРЕВИЧ 770405835717',
            40000,
            100,
            '2015-08-28'
          ],
          [
            128,
            14065478,
            'ФЛ',
            'ДАРЬЯ ГОРКАВЧЕНКО СЕРГЕЕВНА 471009982214',
            10000,
            100,
            '2015-08-28'
          ],
          [
            129,
            14065485,
            'ФЛ',
            'АНТОН КРАСАВИН АЛЕКСАНДРОВИЧ',
            10000,
            0,
            '2015-08-28'
          ],
          [
            130,
            14065486,
            'ФЛ',
            'АНАТОЛИЙ ЗАГАРУЛЯ ВЛАДИМИРОВИЧ',
            10000,
            100,
            '2015-08-28'
          ],
          [
            131,
            14065494,
            'ФЛ',
            'СВЕТЛАНА ШАЛАЕВА СЕРГЕЕВНА 862202706392',
            6373000,
            100,
            '2015-08-28'
          ],
          [
            132,
            14065519,
            'ФЛ',
            'АРТЕМ МАХАЛОВ АЛЕКСАНДРОВИЧ 742001521300',
            10000,
            50,
            '2015-08-28'
          ],
          [
            133,
            14065519,
            'ФЛ',
            'АРТЕМ МАХАЛОВ АЛЕКСАНДРОВИЧ 742001521300',
            10000,
            100,
            '2015-08-28'
          ],
          [
            134,
            14065519,
            'ФЛ',
            'ВЛАДИМИР МАХАЛОВ ВАСИЛЬЕВИЧ 745214563558',
            10000,
            50,
            '2015-08-28'
          ],
          [
            135,
            14065531,
            'ФЛ',
            'ЕВГЕНИЙ ТЕПЛОВСКИЙ СЕРГЕЕВИЧ',
            5000,
            0,
            '2015-08-28'
          ],
          [
            136,
            14065531,
            'ФЛ',
            'СЕРГЕЙ АНКУДИНОВ ЮРЬЕВИЧ 744704205800',
            5000,
            0,
            '2015-08-28'
          ],
          [
            137,
            14065535,
            'ФЛ',
            'АЛЕКСАНДР ЗЕЛЕПУКИН ВЛАДИМИРОВИЧ',
            10000,
            100,
            '2015-08-28'
          ],
          [
            138,
            14065538,
            'ФЛ',
            'МАРИНА БЕЛЯКОВИЧ АДАМОВНА',
            287180,
            35.9,
            '2015-08-28'
          ],
          [
            139,
            14065538,
            'ФЛ',
            'ЕВГЕНИЯ БОРОВСКАЯ СЕРГЕЕВНА 525714814561',
            512820,
            64.1,
            '2015-08-28'
          ],
          [
            140,
            14065549,
            'ФЛ',
            'РОМАН КУЗНЕЦОВ ОЛЕГОВИЧ 330600174052',
            5000,
            50,
            '2015-08-28'
          ],
          [
            141,
            14065549,
            'ФЛ',
            'ЧЕСЛАВ КАРТИНЦЕВ АЛЕКСАНДРОВИЧ',
            5000,
            50,
            '2015-08-28'
          ],
          [
            142,
            14065555,
            'ФЛ',
            'АЛЕКСАНДР ИВАНОВ СЕРГЕЕВИЧ',
            10000,
            100,
            '2015-08-28'
          ],
          [
            143,
            14065560,
            'ФЛ',
            'СЕРГЕЙ МОРЕВ ЮРЬЕВИЧ 720312246650',
            1000,
            9.1,
            '2015-08-28'
          ],
          [
            144,
            14065560,
            'ФЛ',
            'ЕЛЕНА МОРЕВА ВЛАДИМИРОВНА',
            10000,
            90.9,
            '2015-08-28'
          ],
          [
            145,
            14065580,
            'ФЛ',
            'ВИКТОР ПАВЛОВ АЛЕКСАНДРОВИЧ 701404895090',
            5000,
            0,
            '2015-08-28'
          ],
          [
            146,
            14065580,
            'ФЛ',
            'АЛЕКСАНДР БАЯНОВ СЕРГЕЕВИЧ 701711403706',
            5000,
            0,
            '2015-08-28'
          ],
          [
            147,
            14065593,
            'ФЛ',
            'АНТОН НАУМОВ АНАТОЛЬЕВИЧ 594809329220',
            10000,
            100,
            '2015-08-28'
          ],
          [
            148,
            14065599,
            'ФЛ',
            'ЮРИЙ КАРСУНЦЕВ АЛЕКСЕЕВИЧ 744809676933',
            3000,
            30,
            '2015-08-28'
          ],
          [
            149,
            14065599,
            'ФЛ',
            'АНАТОЛИЙ ЗОРИН НИКОЛАЕВИЧ 745304258823',
            7000,
            70,
            '2015-08-28'
          ],
          [
            150,
            14065609,
            'ФЛ',
            'ЕЛЕНА МАТЮХИНА НИКОЛАЕВНА 594304024308',
            12500,
            100,
            '2015-08-28'
          ],
          [
            151,
            14065621,
            'ФЛ',
            'ВЛАДИМИР КАПНИН СЕРГЕЕВИЧ 390504703350',
            10000,
            100,
            '2015-08-28'
          ],
          [
            152,
            14065637,
            'ФЛ',
            'СЕРГЕЙ ПАНКИН АЛЕКСАНДРОВИЧ 402710818109',
            10000,
            100,
            '2015-08-28'
          ],
          [
            155,
            14065689,
            'ФЛ',
            'ОЛЬГА ИЛЬИНА КОНСТАНТИНОВНА 631930395733',
            10000,
            100,
            '2015-08-28'
          ],
          [
            157,
            14065695,
            'ФЛ',
            'АНДРЕЙ БОНДАРЕНКО ВЛАДИМИРОВИЧ 340501200283',
            254000,
            100,
            '2015-08-28'
          ],
          [
            164,
            14065706,
            'ФЛ',
            'МАРИНА ТАРАСОВА ВИКТОРОВНА 641797467980',
            592000,
            59.2,
            '2015-08-28'
          ],
          [
            165,
            14065706,
            'ФЛ',
            'АННА ДОКТОРОВА ПЕТРОВНА 672609532077',
            408000,
            40.8,
            '2015-08-28'
          ],
          [
            166,
            14065721,
            'ФЛ',
            'ВАЛЕНТИНА РАКОВА КИРИЛЛОВНА 782618359660',
            10000,
            100,
            '2015-08-28'
          ],
          [
            167,
            14065722,
            'ФЛ',
            'АЛЕКСАНДР БЫКОВ АНАТОЛЬЕВИЧ',
            100000,
            100,
            '2015-08-28'
          ],
          [
            168,
            14065723,
            'ФЛ',
            'БОРИС ТЫШКЕВИЧ ВЛАДИМИРОВИЧ 773700609252',
            5000,
            7,
            '2015-08-28'
          ],
          [
            169,
            14065723,
            'ФЛ',
            'ВЛАДИМИР ЧЕРВЯКОВ ДЕМЕНЬТЕВИЧ 262705003294',
            10000,
            14,
            '2015-08-28'
          ],
          [
            170,
            14065723,
            'ФЛ',
            'ЮРИЙ БОДРОВ НИКОЛАЕВИЧ 711302175156',
            10000,
            14,
            '2015-08-28'
          ],
          [
            171,
            14065723,
            'ФЛ',
            'ЕВГЕНИЙ КУРБАНОВ ВИКТОРОВИЧ 502909982457',
            20000,
            30,
            '2015-08-28'
          ],
          [
            172,
            14065723,
            'ФЛ',
            'ОЛЬГА ИВАННИКОВА ЮРЬЕВНА 773712837239',
            10000,
            14,
            '2015-08-28'
          ],
          [
            173,
            14065723,
            'ФЛ',
            'АЛЕКСАНДР РАГОЗИН ЕВГЕНЬЕВИЧ 781698810228',
            10000,
            14,
            '2015-08-28'
          ],
          [
            174,
            14065723,
            'ФЛ',
            'АНДРЕЙ ПОДКОЛЬЗИН АЛЕКСАНДРОВИЧ 780508682642',
            5000,
            7,
            '2015-08-28'
          ],
          [
            176,
            14065783,
            'ФЛ',
            'МИХАИЛ АНОХИН МИХАЙЛОВИЧ 503410078970',
            25000,
            100,
            '2015-08-28'
          ],
          [
            177,
            14065812,
            'ФЛ',
            'АНДРЕЙ ГРЕБЕННИКОВ АНДРЕЕВИЧ 343504326917',
            10000,
            100,
            '2015-08-28'
          ],
          [
            181,
            14065823,
            'ФЛ',
            'АЛЕКСЕЙ ВОЛКОВ ВЛАДИМИРОВИЧ 745012028036',
            15000,
            0,
            '2015-08-28'
          ],
          [
            182,
            14065834,
            'ФЛ',
            'ЕВГЕНИЙ ЯРОШИК ВАДИМОВИЧ',
            10000,
            100,
            '2015-08-28'
          ],
          [
            183,
            14065877,
            'ФЛ',
            'МАРИНА ГОРНОСТАЕВА ВЯЧЕСЛАВОВНА 662401861968',
            10000,
            100,
            '2015-08-28'
          ],
          [
            184,
            14065891,
            'ФЛ',
            'ВЯЧЕСЛАВ БОЯРОВ ИВАНОВИЧ',
            5000,
            0,
            '2015-08-28'
          ],
          [
            185,
            14065891,
            'ФЛ',
            'ГАЛИНА ХАИМОВА ВЯЧЕСЛАВОВНА',
            5000,
            0,
            '2015-08-28'
          ],
          [
            187,
            14065925,
            'ФЛ',
            'АЛЕКСЕЙ АЛЕШИН МИХАЙЛОВИЧ 781021161554',
            10000,
            100,
            '2015-08-28'
          ],
          [
            188,
            14065929,
            'ФЛ',
            'АЛЕКСАНДР ГАБЬЕВ АЛЕКСАНДРОВИЧ 421807043551',
            10000,
            100,
            '2015-08-28'
          ],
          [
            189,
            14065932,
            'ФЛ',
            'ПАВЕЛ ЯКОВЛЕВ ОЛЕГОВИЧ 780719608888',
            55000,
            100,
            '2015-08-28'
          ],
          [
            190,
            14065938,
            'ФЛ',
            'ИЛЬДАР ИБРАГИМОВ ОЛЕГОВИЧ 027811547287',
            5000,
            50,
            '2015-08-28'
          ],
          [
            191,
            14065938,
            'ФЛ',
            'АНТОН ПАВЛОВ ВЛАДИСЛАВОВИЧ 027416256103',
            5000,
            50,
            '2015-08-28'
          ],
          [
            198,
            14065989,
            'ФЛ',
            'АНДРЕЙ БЕЗЫМЯННЫЙ ИВАНОВИЧ',
            10000,
            100,
            '2015-08-28'
          ],
          [
            199,
            14066024,
            'ФЛ',
            'ВИКТОРИЯ ХРИСТЕНКО ВАЛЕРЬЕВНА 511002921746',
            10000,
            100,
            '2015-08-28'
          ],
          [
            200,
            14066027,
            'ФЛ',
            'СВЕТЛАНА АКИМОВА АЛЕКСАНДРОВНА 730209483083',
            5000,
            50,
            '2015-08-28'
          ],
          [
            201,
            14066027,
            'ФЛ',
            'ОЛЬГА КРАСНОВА ВЛАДИМИРОВНА 731102258256',
            5000,
            50,
            '2015-08-28'
          ],
          [
            202,
            14066030,
            'ФЛ',
            'ВИЛЕМ ГЛАЗАЧЁВ ЛЕОНИДОВИЧ 323101453765',
            5000,
            50,
            '2015-08-28'
          ],
          [
            203,
            14066030,
            'ФЛ',
            'ЮЛИЯ КИРИЛЕНКО СЕРГЕЕВНА 490905640710',
            5000,
            50,
            '2015-08-28'
          ],
          [
            204,
            14066055,
            'ФЛ',
            'АЛЕКСАНДР КОТОВ ВЛАДИМИРОВИЧ 781719152798',
            12500,
            100,
            '2015-08-28'
          ],
          [
            205,
            14066060,
            'ФЛ',
            'ДАВИД ТКЕШЕЛАШВИЛИ ТЕЙМУРАЗОВИЧ 771671075024',
            120000,
            100,
            '2015-08-28'
          ],
          [
            206,
            14066114,
            'ФЛ',
            'АНАТОЛИЙ КОРЕНЬКОВ АЛЕКСАНДРОВИЧ 391704028730',
            10000,
            100,
            '2015-08-28'
          ],
          [
            207,
            14066124,
            'ЮЛИн',
            '690   АНЕКС ЛИМИТЕД',
            9999,
            99,
            '2015-08-28'
          ],
          [
            208,
            14066124,
            'ЮЛРос',
            '1067746579670 7719590471  ЗАКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО "АРГО-СПЕКТР"',
            1,
            1,
            '2015-08-28'
          ],
          [
            210,
            14066131,
            'ФЛ',
            'АЛЕКСАНДР СИНИЦИН АЛЕКСЕЕВИЧ 631902254378',
            5000,
            0,
            '2015-08-28'
          ],
          [
            211,
            14066167,
            'ФЛ',
            'ВИТАЛИЙ КУЗЬМИНЫХ ВАСИЛЬЕВИЧ',
            5000,
            50,
            '2015-08-28'
          ],
          [
            212,
            14066167,
            'ФЛ',
            'СЕРГЕЙ КУЧМАСОВ АЛЕКСЕЕВИЧ',
            5000,
            50,
            '2015-08-28'
          ],
          [
            213,
            14066186,
            'ФЛ',
            'ФАИНА КОРШУНОВА АНАТОЛЬЕВНА 331400845989',
            48000,
            96,
            '2015-08-28'
          ],
          [
            214,
            14066186,
            'ФЛ',
            'СЕРГЕЙ ДОНСКОВ АЛЕКСАНДРОВИЧ 331400258356',
            2000,
            4,
            '2015-08-28'
          ],
          [
            215,
            14066194,
            'ФЛ',
            'ЕЛЕНА ГОЛЬНИК ЮРЬЕВНА 740416820400',
            10000,
            100,
            '2015-08-28'
          ],
          [
            216,
            14066201,
            'ФЛ',
            'АНДРЕЙ АЛЕКСАНДРОВ ВЛАДИМИРОВИЧ 323205543607',
            10000,
            50,
            '2015-08-28'
          ],
          [
            217,
            14066201,
            'ФЛ',
            'АЛЕКСАНДР МАЗОВ НИКОЛАЕВИЧ 581200201007',
            10000,
            50,
            '2015-08-28'
          ],
          [
            218,
            14066202,
            'ФЛ',
            'ГРИГОРИЙ АМИРАГЯН ВОЛОДЯЕВИЧ 720700847891',
            5000,
            25,
            '2015-08-28'
          ],
          [
            219,
            14066229,
            'ФЛ',
            'АЛЕКСАНДР КАЛИНИН АНАТОЛЬЕВИЧ 165035929210',
            10100,
            100,
            '2015-08-28'
          ],
          [
            220,
            14066236,
            'ФЛ',
            'ВЛАДИМИР ЛИТОВЧЕНКО ГРИГОРЬЕВИЧ 860301499873',
            10000,
            0,
            '2015-08-28'
          ],
          [
            221,
            14066245,
            'ФЛ',
            'ЮРИЙ ДОЛГИХ МИТРОФАНОВИЧ 482501945993',
            15000,
            0,
            '2015-08-28'
          ],
          [
            222,
            14066262,
            'ФЛ',
            'СЕРГЕЙ КАЛЯБИН АЛЕКСАНДРОВИЧ',
            10000,
            0,
            '2015-08-28'
          ],
          [
            223,
            14066266,
            'ФЛ',
            'ИРИНА ПЕТРОВА ВЛАДИМИРОВНА 701718441683',
            10000,
            100,
            '2015-08-28'
          ],
          [224, 14066276, 'ФЛ', 'ДОГАН ДАБАНЛЫ', 101691.79, 100, '2015-08-28'],
          [
            225,
            14066282,
            'ФЛ',
            'ГЕОРГИЙ АНДРЮШКЕВИЧ НИКОЛАЕВИЧ 451400688788',
            4500,
            30,
            '2015-08-28'
          ],
          [
            226,
            14066311,
            'ФЛ',
            'АНДРЕЙ ГОЛЕВ ВИКТОРОВИЧ 323017064665',
            10000,
            100,
            '2015-08-28'
          ],
          [
            227,
            14066320,
            'ФЛ',
            'АРТЕМ МОСКАЛЕВ АЛЕКСЕЕВИЧ 166014832226',
            20000,
            100,
            '2015-08-28'
          ],
          [
            228,
            14066326,
            'ФЛ',
            'МАРИЯ ПЕТРУШКИНА ОЛЕГОВНА 772578824714',
            10000,
            100,
            '2015-08-28'
          ],
          [
            229,
            14066382,
            'ФЛ',
            'ЛЕВ БУСЛАЕВ БОРИСОВИЧ',
            5000,
            50,
            '2015-08-28'
          ],
          [
            230,
            14066382,
            'ФЛ',
            'ДМИТРИЙ ДАНИЛОВ АБРАМОВИЧ',
            5000,
            50,
            '2015-08-28'
          ],
          [
            231,
            14066392,
            'ФЛ',
            'ЕЛЕНА БИТЮКОВА ГЕОРГИЕВНА 504811626520',
            100000,
            100,
            '2015-08-28'
          ],
          [234, 14066407, 'ФЛ', 'РОМАС ЯНКАУСКАС ЮОЗО', 3300, 0, '2015-08-28'],
          [
            235,
            14066407,
            'ФЛ',
            'ВЛАДИМИР КОГАН ЕФИМОВИЧ',
            3300,
            0,
            '2015-08-28'
          ],
          [236, 14066407, 'ФЛ', 'ДАЙНЮС МИНКА', 3400, 0, '2015-08-28'],
          [
            237,
            14066422,
            'ФЛ',
            'НАДЕЖДА ЯГУДИНА ЮРЬЕВНА 583702069405',
            8400,
            100,
            '2015-08-28'
          ],
          [
            238,
            14066423,
            'ФЛ',
            'ВЛАДИМИР ПАВЛОВ АНАТОЛЬЕВИЧ 860401772780',
            10000,
            100,
            '2015-08-28'
          ],
          [
            239,
            14066451,
            'ФЛ',
            'СЕРГЕЙ МОИСЕЕНКО ВЛАДИМИРОВИЧ',
            5000,
            50,
            '2015-08-28'
          ],
          [
            240,
            14066451,
            'ФЛ',
            'ИГОРЬ БАРАНОВ ВИКТОРОВИЧ',
            5000,
            50,
            '2015-08-28'
          ],
          [
            241,
            14066456,
            'ФЛ',
            'ВЛАДИМИР ДМИТРИЕВ ИГОРЕВИЧ 782576170029',
            10000,
            100,
            '2015-08-28'
          ],
          [
            242,
            14066464,
            'ФЛ',
            'ВЛАДИМИР ШЛЫКОВ АЛЕКСАНДРОВИЧ',
            2500,
            20,
            '2015-08-28'
          ],
          [
            243,
            14066469,
            'ФЛ',
            'ИРЕК МУХАМЕДЗЯНОВ РИНАТОВИЧ 165031291818',
            20295,
            100,
            '2015-08-28'
          ],
          [
            244,
            14066482,
            'ФЛ',
            'ДИАНА ЗОЛОТУХИНА БОРИСОВНА',
            308350,
            0,
            '2015-08-28'
          ],
          [
            246,
            14066492,
            'ФЛ',
            'НАТАЛЬЯ ХУДАНИНА ВЛАДИМИРОВНА 590299369226',
            10000,
            0,
            '2015-08-28'
          ],
          [
            247,
            14066503,
            'ФЛ',
            'ВАЛЕРИЙ ПРОХОРОВ АНАТОЛЬЕВИЧ 245503630792',
            10000,
            100,
            '2015-08-28'
          ],
          [
            248,
            14066509,
            'ФЛ',
            'ЕЛЕНА КОРМИЛИЦИНА СЕРГЕЕВНА 507701475979',
            90000,
            100,
            '2015-08-28'
          ],
          [
            249,
            14066534,
            'ФЛ',
            'МАРИЯ ПОКАРЖЕВСКАЯ АЛЕКСАНДРОВНА',
            130000,
            0,
            '2015-08-28'
          ],
          [
            250,
            14066544,
            'ФЛ',
            'АЛЕКСЕЙ ГУБИН АНДРЕЕВИЧ 637204021230',
            5000,
            50,
            '2015-08-28'
          ],
          [
            251,
            14066544,
            'ФЛ',
            'ЮРИЙ ТОСПИН КОНСТАНТИНОВИЧ 631404547389',
            5000,
            50,
            '2015-08-28'
          ],
          [
            252,
            14066575,
            'ФЛ',
            'ВАСИЛИЙ ГАРДЕЦКИЙ НИКОЛАЕВИЧ 282800093460',
            10000,
            100,
            '2015-08-28'
          ],
          [253, 14066598, 'ФЛ', 'АНДРЕЙ БОДЭ БОРИСОВИЧ', 3416, 0, '2015-08-28'],
          [
            254,
            14066598,
            'ФЛ',
            'БОРИС БОДЭ ВЛАДИМИРОВИЧ',
            3795,
            0,
            '2015-08-28'
          ],
          [
            256,
            14066615,
            'ФЛ',
            'КОНСТАНТИН ЧУНОСОВ ЭДУАРДОВИЧ 504216396444',
            50000,
            100,
            '2015-08-28'
          ],
          [
            257,
            14066656,
            'ФЛ',
            'ОЛЬГА ИСАЕВА ЛЕОНИДОВНА',
            10000,
            100,
            '2015-08-28'
          ],
          [
            258,
            14066657,
            'ФЛ',
            'ВИКТОР КИРЕЕВ ВЛАДИМИРОВИЧ 772733581522',
            11000,
            100,
            '2015-08-28'
          ],
          [
            259,
            14066683,
            'ФЛ',
            'ВЛАДИМИР БЕЛОУСОВ НИКОЛАЕВИЧ 782618311041',
            10000,
            0,
            '2015-08-28'
          ],
          [
            260,
            14066683,
            'ФЛ',
            'ЮРИЙ НЕКИПЕЛОВ АНАТОЛЬЕВИЧ 231509484738',
            10000,
            0,
            '2015-08-28'
          ],
          [
            262,
            14066683,
            'ФЛ',
            'НАДЕЖДА ШМЕЛЕВА НИКОЛАЕВНА 504903334566',
            10000,
            0,
            '2015-08-28'
          ],
          [
            263,
            14066683,
            'ФЛ',
            'АНТОН ЯШИН АНДРЕЕВИЧ 633088645759',
            10000,
            0,
            '2015-08-28'
          ],
          [
            264,
            14066683,
            'ФЛ',
            'ВАДИМ КАЛИНИН ЕВГЕНЬЕВИЧ 504903007255',
            10000,
            0,
            '2015-08-28'
          ],
          [
            52,
            14064816,
            'ФЛ',
            'ИВАН ЕРМАКОВ ОЛЕГОВИЧ 772579351235',
            17490,
            1.7,
            '2015-08-28'
          ],
          [
            53,
            14064816,
            'ФЛ',
            'СВЕТЛАНА КОСИНОВА ИГОРЕВНА 503113445352',
            39600,
            3.7,
            '2015-08-28'
          ],
          [
            54,
            14064840,
            'ФЛ',
            'ЕЛЕНА ТИХОМИРОВА БОРИСОВНА 745010966580',
            10000,
            100,
            '2015-08-28'
          ],
          [
            56,
            14064844,
            'ФЛ',
            'ВЕРОНИКА СОРОКИНА ЕВГЕНЬЕВНА 332891970035',
            20000,
            100,
            '2015-08-28'
          ],
          [
            57,
            14064860,
            'ЮЛРос',
            '1040700250403 0701010790  МУНИЦИПАЛЬНОЕ КАЗЕННОЕ УЧРЕЖДЕНИЕ "УПРАВЛЕНИЕ ИМУЩЕСТВЕННЫХ И ЗЕМЕЛЬНЫХ ОТНОШЕНИЙ Г.О. БАКСАН"',
            100000,
            100,
            '2015-08-28'
          ],
          [
            59,
            14064873,
            'ФЛ',
            'ТАТЬЯНА АНДРЕЕВА БОРИСОВНА 781005237407',
            10000,
            100,
            '2015-08-28'
          ],
          [
            60,
            14064878,
            'ФЛ',
            'МИХАИЛ ХАЛТУРИН АНАТОЛЬЕВИЧ 024500265492',
            10000,
            50,
            '2015-08-28'
          ],
          [
            63,
            14064910,
            'ФЛ',
            'МАРИНА ИВАНОВА ВИКТОРОВНА 636700185360',
            6000,
            60,
            '2015-08-28'
          ],
          [
            64,
            14064910,
            'ФЛ',
            'АЛЕКСЕЙ ЧЕРНЫШЕВ АНАТОЛЬЕВИЧ 631207399903',
            4000,
            40,
            '2015-08-28'
          ],
          [
            65,
            14064967,
            'ФЛ',
            'АНДРЕЙ ЧЕБАНЕЦ ВИКТОРОВИЧ 860309448976',
            10000,
            100,
            '2015-08-28'
          ],
          [
            67,
            14064987,
            'ФЛ',
            'СЕРГЕЙ КАЛИНИН ВИКТОРОВИЧ 773606566065',
            500,
            5,
            '2015-08-28'
          ],
          [
            68,
            14064987,
            'ФЛ',
            'РАИСА РОЗИНОВА ГЕННАДЬЕВНА 772815802243',
            9500,
            95,
            '2015-08-28'
          ],
          [
            69,
            14064991,
            'ФЛ',
            'АЛЕКСАНДР ИВАНОВ БОРИСОВИЧ',
            10000,
            0,
            '2015-08-28'
          ],
          [
            70,
            14065003,
            'ФЛ',
            'СЕРГЕЙ ЖЕЛЕЗНЯК ИГОРЕВИЧ',
            50000,
            0,
            '2015-08-28'
          ],
          [
            71,
            14065005,
            'ФЛ',
            'ЭДУАРД ИСМАГИЛОВ ФИЛИСОВИЧ 165051165191',
            10000,
            100,
            '2015-08-28'
          ],
          [
            72,
            14065017,
            'ФЛ',
            'ЕЛЕНА КАРГИНА АЛЕКСАНДРОВНА 280117880522',
            10000,
            100,
            '2015-08-28'
          ],
          [
            73,
            14065026,
            'ФЛ',
            'АЛЕКСЕЙ МЕДВЕДЕВ ВЛАДИМИРОВИЧ 760605181455',
            3125,
            20,
            '2015-08-28'
          ],
          [
            74,
            14065032,
            'ФЛ',
            'АНТОНИНА ЕЗЕРСКАЯ АЛЕКСЕЕВНА',
            10000,
            100,
            '2015-08-28'
          ],
          [
            75,
            14065038,
            'ФЛ',
            'ИЛЬЯ СИНЕВ СЕРГЕЕВИЧ 519053649927',
            10000,
            100,
            '2015-08-28'
          ],
          [
            76,
            14065099,
            'ФЛ',
            'АЛЕКСАНДРА ЛАПТЕВА СЕРГЕЕВНА',
            10000,
            100,
            '2015-08-28'
          ],
          [
            77,
            14065106,
            'ФЛ',
            'АНДРЕЙ КРАСИКОВ ВЛАДИМИРОВИЧ',
            15000,
            100,
            '2015-08-28'
          ],
          [
            83,
            14065126,
            'ФЛ',
            'ЛЮБОВЬ КУЗНЕЦОВА ВЛАДИМИРОВНА',
            12500,
            100,
            '2015-08-28'
          ],
          [
            84,
            14065141,
            'ФЛ',
            'АЛЕКСАНДР ПУШЕЧНИКОВ БОРИСОВИЧ 463100002542',
            10000,
            100,
            '2015-08-28'
          ],
          [
            85,
            14065155,
            'ЮЛИн',
            '196   КОМПАНИЯ "WESTEC DEVELOPMENT LIMITED"',
            118800000,
            0,
            '2015-08-28'
          ],
          [
            86,
            14065155,
            'ЮЛРос',
            'ОТКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО "МЕЖДУНАРОДНАЯ ФИНАНСОВО-ПРОМЫШЛЕННАЯ КОРПОРАЦИЯ "НОВЫЙ ГОРОД"',
            1200000,
            0,
            '2015-08-28'
          ],
          [
            87,
            14065174,
            'ФЛ',
            'ВЯЧЕСЛАВ ЛИМБИР ЛЬВОВИЧ',
            5000,
            0,
            '2015-08-28'
          ],
          [
            89,
            14065192,
            'ФЛ',
            'ИВАН ВОЛКОВ ИВАНОВИЧ',
            10000,
            100,
            '2015-08-28'
          ],
          [
            90,
            14065227,
            'ФЛ',
            'ИВАН АВДЕЕВ АЛЕКСАНДРОВИЧ 590311895700',
            10000,
            0,
            '2015-08-28'
          ]
        ],
        dpObjects: [
          { id: 'DP0.D1', name: 'Id', type: 'Dimension', dataType: 'Number' },
          {
            id: 'DP0.D2',
            name: 'Тип учредителя',
            type: 'Dimension',
            dataType: 'String'
          },
          {
            id: 'DP0.D3',
            name: 'Наименование учредителя',
            type: 'Dimension',
            dataType: 'String'
          },
          {
            id: 'DP0.M4',
            name: 'Доля(руб)',
            type: 'Measure',
            dataType: 'Number',
            aggFunc: 'SUM'
          },
          {
            id: 'DP0.M5',
            name: 'Доля(%)',
            type: 'Measure',
            dataType: 'Number',
            aggFunc: 'SUM'
          },
          { id: 'DP0.D6', name: 'Дата', type: 'Dimension', dataType: 'Date' }
        ]
      }
    ],
    // конец описания поставщиков данных
    variables: [
      // список всех переменных в отчете
      {
        varType: 'DP',
        dp_id: 'DP0',
        id: 'DP0.V1',
        name: 'Id',
        type: 'Dimension',
        dataType: 'String',
        formula: '=[Id]',
        parsedFormula: '=[DP0.D1]'
      },
      {
        varType: 'DP',
        dp_id: 'DP0',
        id: 'DP0.V2',
        name: 'Тип учредителя',
        type: 'Dimension',
        dataType: 'String',
        formula: '=[Тип учредителя]',
        parsedFormula: '=[DP0.D2]'
      },
      {
        varType: 'DP',
        dp_id: 'DP0',
        id: 'DP0.V3',
        name: 'Наименование учредителя',
        type: 'Dimension',
        dataType: 'String',
        formula: '=[Наименование учредителя]',
        parsedFormula: '=[DP0.D3]'
      },
      {
        varType: 'DP',
        dp_id: 'DP0',
        id: 'DP0.V4',
        name: 'Доля(руб)',
        type: 'Measure',
        dataType: 'Number',
        formula: '=[Доля(руб)]',
        parsedFormula: '=[DP0.M4]'
      },
      {
        varType: 'DP',
        dp_id: 'DP0',
        id: 'DP0.V5',
        name: 'Доля(%)',
        type: 'Measure',
        dataType: 'String',
        formula: '=[Доля(%)]',
        parsedFormula: '=[DP0.M5]'
      },
      {
        varType: 'DP',
        dp_id: 'DP0',
        id: 'DP0.V6',
        name: 'Дата',
        type: 'Dimension',
        dataType: 'Date',
        formula: '=[Дата]',
        parsedFormula: '=[DP0.D6]'
      }
    ],
    reports: []
  }
};

export const dataCellObject = {
  id: 'R1.1',
  type: 'cell',
  name: 'ячейка 1',
  size: {
    minimalHeight: 10,
    minimalWidth: 120,
    autofitWidth: false,
    autofitHeight: false
  },
  position: {
    xType: 'Absolute',
    yType: 'Absolute',
    x: 20,
    y: 10
  },
  style: {},
  content: {
    expression: {
      type: 'Measure', // Const | Measure
      dataType: 'Number', // String | Number
      formula: '=sum([Продажи])', // если Measure то начинается с =
      parsedFormula: '=F101([DP0.M1])', // formula | const value - необязательно если константа
      outputFormat: '0.00' // необязательно если константа
    }
  }
};
export const sectionAxesExpression = {
  type: 'Dimension',
  dataType: 'String',
  variable_id: 'DP0.D2',
  sort: {
    sortOrder: 'Asc',
    sortNum: 1 // not required
  }
};
export const sectionAxes = {
  id: 1,
  role: 'Row', // Row | Column
  name: 'Строки',
  expressions: [
    // {
    //   type: 'Dimension',
    //   dataType: 'String',
    //   variable_id: 'DP0.D1',
    //   sort: {
    //     sortOrder: 'None'
    //   }
    // },
    // {
    //   type: 'Dimension',
    //   dataType: 'String',
    //   variable_id: 'DP0.D2',
    //   sort: {
    //     sortOrder: 'Asc',
    //     sortNum: 1
    //   }
    // },
    // {
    //   type: 'Dimension',
    //   dataType: 'String',
    //   variable_id: 'DP0.D3',
    //   sort: {
    //     sortOrder: 'None'
    //   }
    // },
    // {
    //   type: 'Measure',
    //   dataType: 'Number',
    //   variable_id: 'DP0.M1',
    //   sort: {
    //     sortOrder: 'None'
    //   }
    // }
  ]
};
export const section = {
  id: 'R1.3',
  type: 'section',
  name: 'Секция Первая буква города',
  size: {
    minimalHeight: 50
  },
  content: {
    axes: [
      {
        id: 1,
        role: 'Row',
        name: 'Первая буква города',
        expressions: [
          {
            type: 'Dimension',
            dataType: 'String',
            variable_id: 'DP0.V1',
            sort: {
              sortOrder: 'Asc',
              sortNum: 1
            }
          }
        ]
      }
    ],
    dataFilter: {
      // для примера фильтр - в списке
      type: 'filter',
      filterTarget_id: 'DP0.V1',
      filterOperator: 'InList',
      filterOperand1: ['М', 'Т']
    },
    children: [
      // ячейка и таблица в секции
      // {
      //   id: 'R1.3.1',
      //   type: 'cell',
      //   name: 'ячейка 3',
      //   size: {
      //     minimalHeight: 10,
      //     minimalWidth: 120,
      //     autofitWidth: false,
      //     autofitHeight: false
      //   },
      //   position: {
      //     xType: 'Absolute',
      //     yType: 'Relative_Element_Top',
      //     x: 20,
      //     yRelativeElement: 'R1.3',
      //     y: 5
      //   },
      //   style: {},
      //   content: {
      //     expression: {
      //       type: 'Dimension',
      //       dataType: 'String',
      //       formula: '=[Первая буква города]',
      //       parsedFormula: '=[DP0.V1]'
      //     }
      //   }
      // },
      // таблица
      {
        id: 'R1.3.2',
        type: 'vTable',
        name: 'Блок 1',
        position: {
          xType: 'Absolute',
          yType: 'Relative_Element_Top',
          x: 10,
          yRelativeElement: 'R1.3.1',
          y: 5
        },
        style: {},
        content: {
          axes: [
            {
              id: 1,
              role: 'Row',
              name: 'Строки',
              expressions: [
                {
                  type: 'Dimension',
                  dataType: 'String',
                  variable_id: 'DP0.D1',
                  sort: {
                    sortOrder: 'None'
                  }
                },
                {
                  type: 'Dimension',
                  dataType: 'String',
                  variable_id: 'DP0.D2',
                  sort: {
                    sortOrder: 'Asc',
                    sortNum: 1
                  }
                },
                {
                  type: 'Dimension',
                  dataType: 'String',
                  variable_id: 'DP0.D3',
                  sort: {
                    sortOrder: 'None'
                  }
                },
                {
                  type: 'Measure',
                  dataType: 'Number',
                  variable_id: 'DP0.M1',
                  sort: {
                    sortOrder: 'None'
                  }
                }
              ]
            }
          ],
          dataFilter: null,
          layout: {
            headerZone: [
              // набор строк заголовка таблицы (здесь 1 строка)
              {
                id: 'R1.3.2.H1',
                height: 10,
                cells: [
                  {
                    id: 'R1.3.2.H1.1',
                    span: 1,
                    size: { minimalWidth: 60 },
                    expression: {
                      type: 'Const',
                      dataType: 'String',
                      formula: '=NameOf([Страна])',
                      parsedFormula: '=F11([DP0.D1]]'
                    },
                    style_id: 's11'
                  },
                  {
                    id: 'R1.3.2.H1.2',
                    span: 1,
                    size: { minimalWidth: 40 },
                    expression: {
                      type: 'Const',
                      dataType: 'String',
                      formula: '=NameOf([Город])',
                      parsedFormula: '=F11([DP0.D2]]'
                    },
                    style_id: 's11'
                  },
                  {
                    id: 'R1.3.2.H1.3',
                    span: 1,
                    size: { minimalWidth: 40 },
                    expression: {
                      type: 'Const',
                      dataType: 'String',
                      formula: '=NameOf([Год])',
                      parsedFormula: '=F11([DP0.D3]]'
                    },
                    style_id: 's11'
                  },
                  {
                    id: 'R1.3.2.H1.4',
                    span: 1,
                    size: { minimalWidth: 40 },
                    expression: {
                      type: 'Const',
                      dataType: 'String',
                      formula: '=NameOf([Продажи])',
                      parsedFormula: '=F11([DP0.M1]]'
                    },
                    style_id: 's11'
                  }
                ]
              }
            ],
            bodyZone: [
              // набор строк тела таблицы (здесь 1 строка)
              {
                id: 'R1.3.2.B1',
                height: 8,
                cells: [
                  {
                    id: 'R1.3.2.B1.1',
                    span: 1,
                    expression: {
                      type: 'Dimension',
                      dataType: 'String',
                      formula: '=[Страна]',
                      parsedFormula: '=[DP0.D1]'
                    },
                    style_id: 's12'
                  },
                  {
                    id: 'R1.3.2.B1.2',
                    span: 1,
                    size: { minimalWidth: 40 },
                    expression: {
                      type: 'Dimension',
                      dataType: 'String',
                      formula: '=[Город]',
                      parsedFormula: '=[DP0.D2]'
                    },
                    style_id: 's12'
                  },
                  {
                    id: 'R1.3.2.H1.3',
                    span: 1,
                    size: { minimalWidth: 40 },
                    expression: {
                      type: 'Dimension',
                      dataType: 'String',
                      formula: '=[Год]',
                      parsedFormula: '=[DP0.D3]]'
                    },
                    style_id: 's12'
                  },
                  {
                    id: 'R1.3.2.H1.4',
                    span: 1,
                    size: { minimalWidth: 40 },
                    expression: {
                      type: 'Measure',
                      dataType: 'String',
                      formula: '=[Продажи]',
                      parsedFormula: '=[DP0.M1]]'
                    },
                    style_id: 's12'
                  }
                ]
              }
            ],
            footerZone: []
          }
        }
      }
    ]
  }
};

export const reportPageObject = {
  id: 1,
  name: 'Отчет 1',
  paginationMode: 'Quick', // Quick | ?
  displayMode: 'Formula', // Data | Formula
  pageSettings: {
    margins: {
      left: 100,
      right: 100,
      top: 100,
      bottom: 100
    },
    orientation: 'Landscape', // Landscape | Portrait
    height: 1024,
    width: 768,
    recordsHeight: 100,
    recordsWidth: 25,
    scale: 100
  },
  structure: {
    pgHeader: {
      id: 'R1.PH',
      type: 'pgHeader',
      name: 'заготовок страницы',
      size: {
        minimalHeight: 10
      }
    },
    pgBody: {
      id: 'R1',
      type: 'pgBody',
      name: 'тело',
      size: {
        minimalHeight: 10
      },
      content: {
        children: [V_TABLE]
      }
    },
    pgFooter: {
      id: 'R1.PF',
      type: 'pgFooter',
      name: 'нижний колонтитул',
      size: {
        minimalHeight: 15
      }
    }
  },
  alerters: []
};

// export const columnObject = {
//   object: {},
//   header: {
//     styles: {}
//   },
//   cells: {
//     styles: {},
//     format: ''
//   },
//   order: 1
// };
// export const sortingObject = {
//   field: '',
//   sortingType: 'ASC' // DESC
// };

// export const tableObject = {
//   id: 1,
//   title: 'Table 1',
//   titlePosition: 'center',
//   type: 'table',
//   variant: 'table_vertical',
//   position: {
//     x: 100,
//     y: 100
//   },
//   scales: {
//     width: 200,
//     height: 45
//   },
//   sorting: [],
//   filters: [
//     {
//       field: '',
//       condition: 'EQUAL',
//       value: ''
//     }
//   ],
//   styles: {},
//   columns: [],
//   rows: [],
//   values: []
// };
// export const graphObject = {
//   id: 2,
//   title: 'Graph 1',
//   titlePosition: 'center',
//   legend: 'show',
//   legendPosition: 'center',
//   type: 'graph',
//   variant: 'graph1',
//   styles: {},
//   position: {
//     x: 100,
//     y: 100
//   },
//   scales: {
//     width: 250,
//     height: 250
//   },
//   filters: [],
//   objects: {
//     yAxis: [],
//     xAxis: [],
//     default: []
//   }
// };
// export const shapeObject = {
//   id: 3,
//   title: 'Shape 1',
//   type: 'shape',
//   shapeType: 'rect',
//   position: {
//     x: 100,
//     y: 100
//   },
//   scales: {
//     width: 250,
//     height: 250
//   }
// };
// export const textObject = {
//   id: 4,
//   title: 'Text 1',
//   type: 'text',
//   position: {
//     x: 100,
//     y: 100
//   },
//   scales: {
//     width: 250,
//     height: 250
//   },
//   object: {},
//   styles: {}
// };

const reportDesigner = createSlice({
  name: 'reportDesigner',
  initialState: {
    ...reportObject,
    reports: [reportPageObject],
    activeReport: 1,
    activeNodes: []
  },
  reducers: {
    setReportDisplayMode: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );
      report.displayMode = action.payload;
    },
    setActiveReport: (state, action) => {
      state.activeReport = action.payload;
    },
    setActiveNodes: (state, action) => {
      state.activeNodes = action.payload;
    },
    setReports: (state, action) => {
      state.reports = action.payload.reports;
    },
    setStructure: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );
      report.structure = action.payload;
    },
    setActiveNodeStyle: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );

      state.activeNodes.forEach(node => {
        const reportNode = lodash.find(
          report.structure,
          item => item.id === node.id
        );

        reportNode.styles = { ...reportNode.styles, ...action.payload };
      });
    },
    setTableStyle: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );

      state.activeNodes.forEach(node => {
        const reportNode = lodash.find(
          report.structure,
          item => item.id === node.id
        );

        reportNode.columns.forEach(column => {
          if (action.payload.column) {
            if (action.payload.column === column.object.id)
              if (action.payload.isHeader) {
                column.header.styles = action.payload.styles
                  ? {
                      ...column.header.styles,
                      ...action.payload.styles
                    }
                  : {};
              } else {
                column.cells.styles = action.payload.styles
                  ? {
                      ...column.cells.styles,
                      ...action.payload.styles
                    }
                  : {};
              }
          } else {
            if (action.payload.isHeader) {
              column.header.styles = action.payload.styles
                ? {
                    ...column.header.styles,
                    ...action.payload.styles
                  }
                : {};
            } else {
              column.cells.styles = action.payload.styles
                ? {
                    ...column.cells.styles,
                    ...action.payload.styles
                  }
                : {};
            }
          }
        });
      });
    },
    addTableColumn: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );

      const reportNode = lodash.find(
        report.structure,
        item => item.id === action.payload.id
      );

      reportNode.columns = [...reportNode.columns, action.payload.column];
    },
    addTableRow: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );

      const reportNode = lodash.find(
        report.structure,
        item => item.id === action.payload.id
      );

      reportNode.rows = [...reportNode.rows, action.payload.row];
    },
    addTableValue: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );

      const reportNode = lodash.find(
        report.structure,
        item => item.id === action.payload.id
      );

      reportNode.values = [...reportNode.values, action.payload.value];
    },
    addSortingField: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );

      const reportNode = lodash.find(
        report.structure,
        item => item.id === action.payload.id
      );

      reportNode.sorting = action.payload.sorting;
    },
    setTableVariant: (state, action) => {
      const report = lodash.find(
        state.reports,
        item => item.id === state.activeReport
      );

      state.activeNodes.forEach(node => {
        const reportNode = lodash.find(
          report.structure,
          item => item.id === node.id
        );

        reportNode.variant = action.payload;
      });
    }
  }
});

const reportDesignerUI = createSlice({
  name: 'reportDesignerUI',
  initialState: {
    ui: {
      showConfigPanel: false,
      showReportPanel: false,
      showFormulaEditor: false,
      creatingElement: null,
      selectedColumns: null,
      tableType: 'cross',
      graphType: 'graph1',
      zoom: 1
    }
  },
  reducers: {
    setSelectedColumns: (state, action) => {
      if (!action.payload) {
        state.ui.selectedColumns = {};
      } else {
        state.ui.selectedColumns = {
          ...state.ui.selectedColumns,
          ...action.payload
        };
      }
    },
    setCreatingElement: (state, action) => {
      state.ui.creatingElement = action.payload;
    },
    setReportPanelVisible: state => {
      state.ui.showReportPanel = !state.ui.showReportPanel;
    },
    setFormulaEditorVisible: state => {
      state.ui.showFormulaEditor = !state.ui.showFormulaEditor;
    },
    setConfigPanelVisible: (state, action) => {
      if (action?.payload) {
        state.ui.showConfigPanel = action?.payload;
      } else {
        state.ui.showConfigPanel = !state.ui.showConfigPanel;
      }
    },
    setTableType: (state, action) => {
      state.ui.tableType = action.payload;
    },
    setGraphType: (state, action) => {
      state.ui.graphType = action.payload;
    },
    setZoom: (state, action) => {
      state.ui.zoom = action.payload;
    }
  }
});

export const {
  setReportDisplayMode,
  setActiveReport,
  setActiveNodes,
  setReports,
  setStructure,
  setActiveNodeStyle,
  setTableStyle,
  addTableColumn,
  addSortingField,
  setTableVariant,
  addTableRow,
  addTableValue
} = reportDesigner.actions;

export const {
  setCreatingElement,
  setReportPanelVisible,
  setFormulaEditorVisible,
  setConfigPanelVisible,
  setSelectedColumns,
  setTableType,
  setGraphType,
  setZoom
} = reportDesignerUI.actions;

export default combineReducers({
  reportsUi: reportDesignerUI.reducer,
  reportsData: undoable(reportDesigner.reducer)
});
